apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_me.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_mc_me.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MC_ME_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MC_ME_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* MC_ME Register Offsets ***************************************************/

#define S32K3XX_MC_ME_CTL_KEY_OFFSET           (0x0000) /* Control Key Register (CTL_KEY) */
#define S32K3XX_MC_ME_MODE_CONF_OFFSET         (0x0004) /* Mode Configuration Register (MODE_CONF) */
#define S32K3XX_MC_ME_MODE_UPD_OFFSET          (0x0008) /* Mode Update Register (MODE_UPD) */
#define S32K3XX_MC_ME_MODE_STAT_OFFSET         (0x000c) /* Mode Status Register (MODE_STAT) */
#define S32K3XX_MC_ME_MAIN_COREID_OFFSET       (0x0010) /* Main Core ID Register (MAIN_COREID) */
#define S32K3XX_MC_ME_PRTN0_PCONF_OFFSET       (0x0100) /* Partition 0 Process Configuration Register (PRTN0_PCONF) */
#define S32K3XX_MC_ME_PRTN0_PUPD_OFFSET        (0x0104) /* Partition 0 Process Update Register (PRTN0_PUPD) */
#define S32K3XX_MC_ME_PRTN0_STAT_OFFSET        (0x0108) /* Partition 0 Status Register (PRTN0_STAT) */
#define S32K3XX_MC_ME_PRTN0_COFB1_STAT_OFFSET  (0x0114) /* Partition 0 COFB Set 1 Clock Status Register (PRTN0_COFB1_STAT) */
#define S32K3XX_MC_ME_PRTN0_COFB1_CLKEN_OFFSET (0x0134) /* Partition 0 COFB Set 1 Clock Enable Register (PRTN0_COFB1_CLKEN) */
#define S32K3XX_MC_ME_PRTN0_CORE0_PCONF_OFFSET (0x0140) /* Partition 0 Core 0 Process Configuration Register (PRTN0_CORE0_PCONF) */
#define S32K3XX_MC_ME_PRTN0_CORE0_PUPD_OFFSET  (0x0144) /* Partition 0 Core 0 Process Update Register (PRTN0_CORE0_PUPD) */
#define S32K3XX_MC_ME_PRTN0_CORE0_STAT_OFFSET  (0x0148) /* Partition 0 Core 0 Status Register (PRTN0_CORE0_STAT) */
#define S32K3XX_MC_ME_PRTN0_CORE0_ADDR_OFFSET  (0x014c) /* Partition 0 Core 0 Address Register (PRTN0_CORE0_ADDR) */
#define S32K3XX_MC_ME_PRTN0_CORE1_PCONF_OFFSET (0x0160) /* Partition 0 Core 1 Process Configuration Register (PRTN0_CORE1_PCONF) */
#define S32K3XX_MC_ME_PRTN0_CORE1_PUPD_OFFSET  (0x0164) /* Partition 0 Core 1 Process Update Register (PRTN0_CORE1_PUPD) */
#define S32K3XX_MC_ME_PRTN0_CORE1_STAT_OFFSET  (0x0168) /* Partition 0 Core 1 Status Register (PRTN0_CORE1_STAT) */
#define S32K3XX_MC_ME_PRTN0_CORE1_ADDR_OFFSET  (0x016c) /* Partition 0 Core 1 Address Register (PRTN0_CORE1_ADDR) */
#define S32K3XX_MC_ME_PRTN0_CORE2_STAT_OFFSET  (0x0188) /* Partition 0 Core 2 Status Register (PRTN0_CORE2_STAT) */
#define S32K3XX_MC_ME_PRTN0_CORE2_ADDR_OFFSET  (0x018c) /* Partition 0 Core 2 Address Register (PRTN0_CORE2_ADDR) */
#define S32K3XX_MC_ME_PRTN1_PCONF_OFFSET       (0x0300) /* Partition 1 Process Configuration Register (PRTN1_PCONF) */
#define S32K3XX_MC_ME_PRTN1_PUPD_OFFSET        (0x0304) /* Partition 1 Process Update Register (PRTN1_PUPD) */
#define S32K3XX_MC_ME_PRTN1_STAT_OFFSET        (0x0308) /* Partition 1 Status Register (PRTN1_STAT) */
#define S32K3XX_MC_ME_PRTN1_COFB0_STAT_OFFSET  (0x0310) /* Partition 1 COFB Set 0 Clock Status Register (PRTN1_COFB0_STAT) */
#define S32K3XX_MC_ME_PRTN1_COFB1_STAT_OFFSET  (0x0314) /* Partition 1 COFB Set 1 Clock Status Register (PRTN1_COFB1_STAT) */
#define S32K3XX_MC_ME_PRTN1_COFB2_STAT_OFFSET  (0x0318) /* Partition 1 COFB Set 2 Clock Status Register (PRTN1_COFB2_STAT) */
#define S32K3XX_MC_ME_PRTN1_COFB3_STAT_OFFSET  (0x031c) /* Partition 1 COFB Set 3 Clock Status Register (PRTN1_COFB3_STAT) */
#define S32K3XX_MC_ME_PRTN1_COFB0_CLKEN_OFFSET (0x0330) /* Partition 1 COFB Set 0 Clock Enable Register (PRTN1_COFB0_CLKEN) */
#define S32K3XX_MC_ME_PRTN1_COFB1_CLKEN_OFFSET (0x0334) /* Partition 1 COFB Set 1 Clock Enable Register (PRTN1_COFB1_CLKEN) */
#define S32K3XX_MC_ME_PRTN1_COFB2_CLKEN_OFFSET (0x0338) /* Partition 1 COFB Set 2 Clock Enable Register (PRTN1_COFB2_CLKEN) */
#define S32K3XX_MC_ME_PRTN1_COFB3_CLKEN_OFFSET (0x033c) /* Partition 1 COFB Set 3 Clock Enable Register (PRTN1_COFB3_CLKEN) */
#define S32K3XX_MC_ME_PRTN2_PCONF_OFFSET       (0x0500) /* Partition 2 Process Configuration Register (PRTN2_PCONF) */
#define S32K3XX_MC_ME_PRTN2_PUPD_OFFSET        (0x0504) /* Partition 2 Process Update Register (PRTN2_PUPD) */
#define S32K3XX_MC_ME_PRTN2_STAT_OFFSET        (0x0508) /* Partition 2 Status Register (PRTN2_STAT) */
#define S32K3XX_MC_ME_PRTN2_COFB0_STAT_OFFSET  (0x0510) /* Partition 2 COFB Set 0 Clock Status Register (PRTN2_COFB0_STAT) */
#define S32K3XX_MC_ME_PRTN2_COFB1_STAT_OFFSET  (0x0514) /* Partition 2 COFB Set 1 Clock Status Register (PRTN2_COFB1_STAT) */
#define S32K3XX_MC_ME_PRTN2_COFB0_CLKEN_OFFSET (0x0530) /* Partition 2 COFB Set 0 Clock Enable Register (PRTN2_COFB0_CLKEN) */
#define S32K3XX_MC_ME_PRTN2_COFB1_CLKEN_OFFSET (0x0534) /* Partition 2 COFB Set 1 Clock Enable Register (PRTN2_COFB1_CLKEN) */

/* MC_ME Register Addresses *************************************************/

#define S32K3XX_MC_ME_CTL_KEY                  (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_CTL_KEY_OFFSET)
#define S32K3XX_MC_ME_MODE_CONF                (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_MODE_CONF_OFFSET)
#define S32K3XX_MC_ME_MODE_UPD                 (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_MODE_UPD_OFFSET)
#define S32K3XX_MC_ME_MODE_STAT                (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_MODE_STAT_OFFSET)
#define S32K3XX_MC_ME_MAIN_COREID              (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_MAIN_COREID_OFFSET)
#define S32K3XX_MC_ME_PRTN0_PCONF              (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_PCONF_OFFSET)
#define S32K3XX_MC_ME_PRTN0_PUPD               (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_PUPD_OFFSET)
#define S32K3XX_MC_ME_PRTN0_STAT               (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN0_COFB1_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_COFB1_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN0_COFB1_CLKEN        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_COFB1_CLKEN_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE0_PCONF        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE0_PCONF_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE0_PUPD         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE0_PUPD_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE0_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE0_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE0_ADDR         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE0_ADDR_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE1_PCONF        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE1_PCONF_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE1_PUPD         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE1_PUPD_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE1_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE1_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE1_ADDR         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE1_ADDR_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE2_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE2_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN0_CORE2_ADDR         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN0_CORE2_ADDR_OFFSET)
#define S32K3XX_MC_ME_PRTN1_PCONF              (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_PCONF_OFFSET)
#define S32K3XX_MC_ME_PRTN1_PUPD               (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_PUPD_OFFSET)
#define S32K3XX_MC_ME_PRTN1_STAT               (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB0_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB0_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB1_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB1_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB2_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB2_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB3_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB3_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB0_CLKEN        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB0_CLKEN_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB1_CLKEN        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB1_CLKEN_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB2_CLKEN        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB2_CLKEN_OFFSET)
#define S32K3XX_MC_ME_PRTN1_COFB3_CLKEN        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN1_COFB3_CLKEN_OFFSET)
#define S32K3XX_MC_ME_PRTN2_PCONF              (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN2_PCONF_OFFSET)
#define S32K3XX_MC_ME_PRTN2_PUPD               (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN2_PUPD_OFFSET)
#define S32K3XX_MC_ME_PRTN2_STAT               (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN2_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN2_COFB0_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN2_COFB0_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN2_COFB1_STAT         (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN2_COFB1_STAT_OFFSET)
#define S32K3XX_MC_ME_PRTN2_COFB0_CLKEN        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN2_COFB0_CLKEN_OFFSET)
#define S32K3XX_MC_ME_PRTN2_COFB1_CLKEN        (S32K3XX_MC_ME_BASE + S32K3XX_MC_ME_PRTN2_COFB1_CLKEN_OFFSET)

/* MC_ME Register Bitfield Definitions **************************************/

/* Control Key Register (CTL_KEY) */

#define MC_ME_CTL_KEY_SHIFT               (0)       /* Bits 0-15: Control Key (KEY) */
#define MC_ME_CTL_KEY_MASK                (0xffff << MC_ME_CTL_KEY_SHIFT)
#define MC_ME_CTL_KEY(n)                  ((0xffff & (n)) << MC_ME_CTL_KEY_SHIFT)
                                                    /* Bits 16-31: Reserved */

/* Mode Configuration Register (MODE_CONF) */
#define MC_ME_MODE_CONF_DEST_RST          (1 << 0)  /* Bit 0: Destructive reset request (DEST_RST) */
#define MC_ME_MODE_CONF_FUNC_RST          (1 << 1)  /* Bit 1: Functional reset request (FUNC_RST) */
                                                    /* Bits 2-14: Reserved */
#define MC_ME_MODE_CONF_STANDBY           (1 << 15) /* Bit 15: Standby request (STANDBY) */
                                                    /* Bits 16-31: Reserved */

/* Mode Update Register (MODE_UPD) */

#define MC_ME_MODE_UPD                    (1 << 0)  /* Bit 0: Mode update (MODE_UPD) */
                                                    /* Bits 1-31: Reserved */

/* Mode Status Register (MODE_STAT) */

#define MC_ME_MODE_STAT_PREV_MODE         (1 << 0)  /* Bit 0: Previous mode (PREV_MODE) */
                                                    /* Bits 1-31: Reserved */

/* Main Core ID Register (MAIN_COREID) */

#define MC_ME_MAIN_COREID_CIDX_SHIFT      (0)       /* Bits 0-2: Core index (CIDX) */
#define MC_ME_MAIN_COREID_CIDX_MASK       (0x07 << MC_ME_MAIN_COREID_CIDX_SHIFT)
                                                    /* Bits 3-7: Reserved */
#define MC_ME_MAIN_COREID_PIDX_SHIFT      (8)       /* Bits 8-12: Partition index (PIDX) */
#define MC_ME_MAIN_COREID_PIDX_MASK       (0x1f << MC_ME_MAIN_COREID_PIDX_SHIFT)
                                                    /* Bits 13-31: Reserved */

/* Partition n Process Configuration Register (PRTNn_PCONF) */

#define MC_ME_PRTN_PCONF_PCE              (1 << 0)  /* Bit 0: Partition clock enable (PCE) */
                                                    /* Bits 1-31: Reserved */

