apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_me.h
/* Partition n Process Update Register (PRTNn_PUPD) */

#define MC_ME_PRTN_PUPD_PCUD              (1 << 0)  /* Bit 0: Partition clock update (PCUD) */
                                                    /* Bits 1-31: Reserved */

/* Partition n Status Register (PRTN_STAT) */

#define MC_ME_PRTN_STAT_PCS               (1 << 0)  /* Bit 0: Partition clock status (PCS) */
                                                    /* Bits 1-31: Reserved */

/* Partition 0 COFB Set 1 Clock Status Register (PRTN0_COFB1_STAT) */

#define MC_ME_PRTN0_COFB1_STAT_TRGMUX     (1 << 0)  /* Bit 0: TRGMUX clock status (BLOCK32) */
#define MC_ME_PRTN0_COFB1_STAT_BCTU       (1 << 1)  /* Bit 1: BCTU clock status (BLOCK33) */
#define MC_ME_PRTN0_COFB1_STAT_EMIOS0     (1 << 2)  /* Bit 2: EMIOS0 clock status (BLOCK34) */
#define MC_ME_PRTN0_COFB1_STAT_EMIOS1     (1 << 3)  /* Bit 3: EMIOS1 clock status (BLOCK35) */
#define MC_ME_PRTN0_COFB1_STAT_EMIOS2     (1 << 4)  /* Bit 4: EMIOS2 clock status (BLOCK36) */
                                                    /* Bit 5: Reserved */
#define MC_ME_PRTN0_COFB1_STAT_LCU0       (1 << 6)  /* Bit 6: LCU0 clock status (BLOCK38) */
#define MC_ME_PRTN0_COFB1_STAT_LCU1       (1 << 7)  /* Bit 7: LCU1 clock status (BLOCK39) */
#define MC_ME_PRTN0_COFB1_STAT_ADC0       (1 << 8)  /* Bit 8: ADC0 clock status (BLOCK40) */
#define MC_ME_PRTN0_COFB1_STAT_ADC1       (1 << 9)  /* Bit 9: ADC1 clock status (BLOCK41) */
#define MC_ME_PRTN0_COFB1_STAT_ADC2       (1 << 10) /* Bit 10: ADC2 clock status (BLOCK42) */
                                                    /* Bit 11: Reserved */
#define MC_ME_PRTN0_COFB1_STAT_PIT0       (1 << 12) /* Bit 12: PIT0 clock status (BLOCK44) */
#define MC_ME_PRTN0_COFB1_STAT_PIT1       (1 << 13) /* Bit 13: PIT1 clock status (BLOCK45) */
#define MC_ME_PRTN0_COFB1_STAT_MU2_MUA    (1 << 14) /* Bit 14: MU2_MUA clock status (BLOCK46) */
#define MC_ME_PRTN0_COFB1_STAT_MU2_MUB    (1 << 15) /* Bit 15: MU2_MUB clock status (BLOCK47) */
                                                    /* Bits 16-31: Reserved */

/* Partition 0 COFB Set 1 Clock Enable Register (PRTN0_COFB1_CLKEN) */

#define MC_ME_PRTN0_COFB1_CLKEN_TRGMUX    (1 << 0)  /* Bit 0: TRGMUX clock enable (REQ32) */
#define MC_ME_PRTN0_COFB1_CLKEN_BCTU      (1 << 1)  /* Bit 1: BCTU clock enable (REQ33) */
#define MC_ME_PRTN0_COFB1_CLKEN_EMIOS0    (1 << 2)  /* Bit 2: EMIOS0 clock enable (REQ34) */
#define MC_ME_PRTN0_COFB1_CLKEN_EMIOS1    (1 << 3)  /* Bit 3: EMIOS1 clock enable (REQ35) */
#define MC_ME_PRTN0_COFB1_CLKEN_EMIOS2    (1 << 4)  /* Bit 4: EMIOS2 clock enable (REQ36) */
                                                    /* Bit 5: Reserved */
#define MC_ME_PRTN0_COFB1_CLKEN_LCU0      (1 << 6)  /* Bit 6: LCU0 clock enable (REQ38) */
#define MC_ME_PRTN0_COFB1_CLKEN_LCU1      (1 << 7)  /* Bit 7: LCU1 clock enable (REQ39) */
#define MC_ME_PRTN0_COFB1_CLKEN_ADC0      (1 << 8)  /* Bit 8: ADC0 clock enable (REQ40) */
#define MC_ME_PRTN0_COFB1_CLKEN_ADC1      (1 << 9)  /* Bit 9: ADC1 clock enable (REQ41) */
#define MC_ME_PRTN0_COFB1_CLKEN_ADC2      (1 << 10) /* Bit 10: ADC2 clock enable (REQ42) */
                                                    /* Bit 11: Reserved */
#define MC_ME_PRTN0_COFB1_CLKEN_PIT0      (1 << 12) /* Bit 12: PIT0 clock enable (REQ44) */
#define MC_ME_PRTN0_COFB1_CLKEN_PIT1      (1 << 13) /* Bit 13: PIT1 clock enable (REQ45) */
#define MC_ME_PRTN0_COFB1_CLKEN_MU2_MUA   (1 << 14) /* Bit 14: MU2_MUA clock enable (REQ46) */
#define MC_ME_PRTN0_COFB1_CLKEN_MU2_MUB   (1 << 15) /* Bit 15: MU2_MUB clock enable (REQ47) */
#define MC_ME_PRTN0_COFB1_CLKEN_I3C       (1 << 16) /* Bit 16: I3C clock enable (REQ48) */
                                                    /* Bits 17-31: Reserved */

/* Partition 0 Core n Process Configuration Register (PRTN0_COREn_PCONF) */

#define MC_ME_PRTN0_CORE_PCONF            (1 << 0)  /* Bit 0: Core n clock enable (CCE) */
                                                    /* Bits 1-31: Reserved */

/* Partition 0 Core n Process Update Register (PRTN0_COREn_PUPD) */

#define MC_ME_PRTN0_CORE_PUPD             (1 << 0)  /* Bit 0: Core n clock update (CCUPD) */
                                                    /* Bits 1-31: Reserved */

/* Partition 0 Core n Status Register (PRTN0_COREn_STAT) */

#define MC_ME_PRTN0_CORE_STAT             (1 << 0)  /* Bit 0: Core n clock process status (CCS) */
                                                    /* Bits 1-30: Reserved */
#define MC_ME_PRTN0_CORE_WFI              (1 << 31) /* Bit 31: Wait for interrupt status (WFI) */

/* Partition 0 Core n Address Register (PRTN0_COREn_ADDR) */

                                                    /* Bits 0-1: Reserved */
#define MC_ME_PRTN0_CORE_ADDR_SHIFT       (2)       /* Bits 2-31: Address (ADDR) */
#define MC_ME_PRTN0_CORE_ADDR_MASK        (0x3fffffff << MC_ME_PRTN0_CORE0_ADDR_SHIFT)

/* Partition 1 COFB Set 0 Clock Status Register (PRTN1_COFB0_STAT) */

#define MC_ME_PRTN1_COFB0_STAT_AXBS       (1 << 0)  /* Bit 0: AXBS clock status (BLOCK0) */
#define MC_ME_PRTN1_COFB0_STAT_XBIC0      (1 << 1)  /* Bit 1: XBIC clock status (BLOCK1) */
#define MC_ME_PRTN1_COFB0_STAT_XBIC1      (1 << 2)  /* Bit 2: XBIC clock status (BLOCK2) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA       (1 << 3)  /* Bit 3: eDMA clock status (BLOCK3) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD0  (1 << 4)  /* Bit 4: eDMA TCD0 clock status (BLOCK4) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD1  (1 << 5)  /* Bit 5: eDMA TCD1 clock status (BLOCK5) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD2  (1 << 6)  /* Bit 6: eDMA TCD2 clock status (BLOCK6) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD3  (1 << 7)  /* Bit 7: eDMA TCD3 clock status (BLOCK7) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD4  (1 << 8)  /* Bit 8: eDMA TCD4 clock status (BLOCK8) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD5  (1 << 9)  /* Bit 9: eDMA TCD5 clock status (BLOCK9) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD6  (1 << 10) /* Bit 10: eDMA TCD6 clock status (BLOCK10) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD7  (1 << 11) /* Bit 11: eDMA TCD7 clock status (BLOCK11) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD8  (1 << 12) /* Bit 12: eDMA TCD8 clock status (BLOCK12) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD9  (1 << 13) /* Bit 13: eDMA TCD9 clock status (BLOCK13) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD10 (1 << 14) /* Bit 14: eDMA TCD10 clock status (BLOCK14) */
#define MC_ME_PRTN1_COFB0_STAT_EDMA_TCD11 (1 << 15) /* Bit 15: eDMA TCD11 clock status (BLOCK15) */
#define MC_ME_PRTN1_COFB0_STAT_DEBUG_APB0 (1 << 16) /* Bit 16: Debug_APB clock status (BLOCK16) */
#define MC_ME_PRTN1_COFB0_STAT_DEBUG_APB1 (1 << 17) /* Bit 17: Debug_APB clock status (BLOCK17) */
#define MC_ME_PRTN1_COFB0_STAT_DEBUG_APB2 (1 << 18) /* Bit 18: Debug_APB clock status (BLOCK18) */
#define MC_ME_PRTN1_COFB0_STAT_DEBUG_APB3 (1 << 19) /* Bit 19: Debug_APB clock status (BLOCK19) */
#define MC_ME_PRTN1_COFB0_STAT_DEBUG_APB4 (1 << 20) /* Bit 20: Debug_APB clock status (BLOCK20) */
#define MC_ME_PRTN1_COFB0_STAT_SDA_AP     (1 << 21) /* Bit 21: SDA-AP clock status (BLOCK21) */
#define MC_ME_PRTN1_COFB0_STAT_EIM        (1 << 22) /* Bit 22: EIM clock status (BLOCK22) */
#define MC_ME_PRTN1_COFB0_STAT_ERM        (1 << 23) /* Bit 23: ERM clock status (BLOCK23) */
#define MC_ME_PRTN1_COFB0_STAT_MSCM       (1 << 24) /* Bit 24: MSCM clock status (BLOCK24) */
#define MC_ME_PRTN1_COFB0_STAT_PRAMC0     (1 << 25) /* Bit 25: PRAMC0 clock status (BLOCK25) */
#define MC_ME_PRTN1_COFB0_STAT_PFLASH     (1 << 26) /* Bit 26: PFLASH clock status (BLOCK26) */
#define MC_ME_PRTN1_COFB0_STAT_PFASH_ALT  (1 << 27) /* Bit 27: PFLASH_alt clock status (BLOCK27) */
#define MC_ME_PRTN1_COFB0_STAT_SWT0       (1 << 28) /* Bit 28: SWT0 clock status (BLOCK28) */
#define MC_ME_PRTN1_COFB0_STAT_STM0       (1 << 29) /* Bit 29: STM0 clock status (BLOCK29) */
#define MC_ME_PRTN1_COFB0_STAT_XRDC       (1 << 30) /* Bit 30: XRDC clock status (BLOCK30) */
#define MC_ME_PRTN1_COFB0_STAT_INTM       (1 << 31) /* Bit 31: INTM clock status (BLOCK31) */

/* Partition 1 COFB Set 1 Clock Status Register (PRTN1_COFB1_STAT) */

#define MC_ME_PRTN1_COFB1_STAT_DMAMUX0    (1 << 0)  /* Bit 0: DMAMUX0 clock status (BLOCK32) */
#define MC_ME_PRTN1_COFB1_STAT_DMAMUX1    (1 << 1)  /* Bit 1: DMAMUX1 clock status (BLOCK33) */
#define MC_ME_PRTN1_COFB1_STAT_RTC        (1 << 2)  /* Bit 2: RTC clock status (BLOCK34) */
#define MC_ME_PRTN1_COFB1_STAT_MC_RGM     (1 << 3)  /* Bit 3: MC_RGM clock status (BLOCK35) */

#define MC_ME_PRTN1_COFB1_STAT_SIUL_VIRTWRAPPER_PDAC0_HSE0   (1 << 4)  /* Bit 4: SIUL_VIRTWRAPPER_PDAC0_HSE clock status (BLOCK36) */
#define MC_ME_PRTN1_COFB1_STAT_SIUL_VIRTWRAPPER_PDAC0_HSE1   (1 << 5)  /* Bit 5: SIUL_VIRTWRAPPER_PDAC0_HSE clock status (BLOCK37) */
#define MC_ME_PRTN1_COFB1_STAT_SIUL_VIRTWRAPPER_PDAC1_M7_0_0 (1 << 6)  /* Bit 6: SIUL_VIRTWRAPPER_PDAC1_M7_0 clock status (BLOCK38) */
#define MC_ME_PRTN1_COFB1_STAT_SIUL_VIRTWRAPPER_PDAC1_M7_0_1 (1 << 7)  /* Bit 7: SIUL_VIRTWRAPPER_PDAC1_M7_0 clock status (BLOCK39) */
#define MC_ME_PRTN1_COFB1_STAT_SIUL_VIRTWRAPPER_PDAC2_M7_1_0 (1 << 8)  /* Bit 8: SIUL_VIRTWRAPPER_PDAC2_M7_1 clock status (BLOCK40) */
#define MC_ME_PRTN1_COFB1_STAT_SIUL_VIRTWRAPPER_PDAC2_M7_1_1 (1 << 9)  /* Bit 9: SIUL_VIRTWRAPPER_PDAC2_M7_1 clock status (BLOCK41) */
#define MC_ME_PRTN1_COFB1_STAT_SIUL_VIRTWRAPPER_PDAC3        (1 << 10) /* Bit 10: SIUL_VIRTWRAPPER_PDAC3 clock status (BLOCK42) */

#define MC_ME_PRTN1_COFB1_STAT_DCM        (1 << 11) /* Bit 11: DCM clock status (BLOCK43) */
                                                    /* Bit 12: Reserved */
#define MC_ME_PRTN1_COFB1_STAT_WKPU       (1 << 13) /* Bit 13: WKPU clock status (BLOCK45) */
                                                    /* Bit 14: Reserved */
#define MC_ME_PRTN1_COFB1_STAT_CMU        (1 << 15) /* Bit 15: CMU0-5 clock status (BLOCK47) */
                                                    /* Bit 16: Reserved */
#define MC_ME_PRTN1_COFB1_STAT_TSPC       (1 << 17) /* Bit 17: TSPC clock status (BLOCK49) */
#define MC_ME_PRTN1_COFB1_STAT_SIRC       (1 << 18) /* Bit 18: SIRC clock status (BLOCK50) */
#define MC_ME_PRTN1_COFB1_STAT_SXOSC      (1 << 19) /* Bit 19: SXOSC clock status (BLOCK51) */
#define MC_ME_PRTN1_COFB1_STAT_FIRC       (1 << 20) /* Bit 20: FIRC clock status (BLOCK52) */
#define MC_ME_PRTN1_COFB1_STAT_FXOSC      (1 << 21) /* Bit 21: FXOSC clock status (BLOCK53) */
#define MC_ME_PRTN1_COFB1_STAT_MC_CGM     (1 << 22) /* Bit 22: MC_CGM clock status (BLOCK54) */
#define MC_ME_PRTN1_COFB1_STAT_MC_ME      (1 << 23) /* Bit 23: MC_ME clock status (BLOCK55) */
#define MC_ME_PRTN1_COFB1_STAT_PLL        (1 << 24) /* Bit 24: PLL clock status (BLOCK56) */
                                                    /* Bit 25: Reserved */
#define MC_ME_PRTN1_COFB1_STAT_PMC        (1 << 26) /* Bit 26: PMC clock status (BLOCK58) */
#define MC_ME_PRTN1_COFB1_STAT_FMU        (1 << 27) /* Bit 27: FMU clock status (BLOCK59) */
#define MC_ME_PRTN1_COFB1_STAT_FMU_ALT    (1 << 28) /* Bit 28: FMU_alt clock status (BLOCK60) */
                                                    /* Bits 29-30: Reserved */
#define MC_ME_PRTN1_COFB1_STAT_PIT2       (1 << 31) /* Bit 31: PIT2 clock status (BLOCK63) */

/* Partition 1 COFB Set 2 Clock Status Register (PRTN1_COFB2_STAT) */

                                                    /* Bit 0: Reserved */
#define MC_ME_PRTN1_COFB2_STAT_FLEXCAN0   (1 << 1)  /* Bit 1: FlexCAN0 clock status (BLOCK65) */
#define MC_ME_PRTN1_COFB2_STAT_FLEXCAN1   (1 << 2)  /* Bit 2: FlexCAN1 clock status (BLOCK66) */
#define MC_ME_PRTN1_COFB2_STAT_FLEXCAN2   (1 << 3)  /* Bit 3: FlexCAN2 clock status (BLOCK67) */
#define MC_ME_PRTN1_COFB2_STAT_FLEXCAN3   (1 << 4)  /* Bit 4: FlexCAN3 clock status (BLOCK68) */
#define MC_ME_PRTN1_COFB2_STAT_FLEXCAN4   (1 << 5)  /* Bit 5: FlexCAN4 clock status (BLOCK69) */
#define MC_ME_PRTN1_COFB2_STAT_FLEXCAN5   (1 << 6)  /* Bit 6: FlexCAN5 clock status (BLOCK70) */
                                                    /* Bits 7-8: Reserved */
#define MC_ME_PRTN1_COFB2_STAT_FLEXIO     (1 << 9)  /* Bit 9: FlexIO clock status (BLOCK73) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART0    (1 << 10) /* Bit 10: LPUART0 clock status (BLOCK74) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART1    (1 << 11) /* Bit 11: LPUART1 clock status (BLOCK75) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART2    (1 << 12) /* Bit 12: LPUART2 clock status (BLOCK76) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART3    (1 << 13) /* Bit 13: LPUART3 clock status (BLOCK77) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART4    (1 << 14) /* Bit 14: LPUART4 clock status (BLOCK78) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART5    (1 << 15) /* Bit 15: LPUART5 clock status (BLOCK79) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART6    (1 << 16) /* Bit 16: LPUART6 clock status (BLOCK80) */
#define MC_ME_PRTN1_COFB2_STAT_LPUART7    (1 << 17) /* Bit 17: LPUART7 clock status (BLOCK81) */
                                                    /* Bits 18-19: Reserved */
#define MC_ME_PRTN1_COFB2_STAT_LPI2C0     (1 << 20) /* Bit 20: LPI2C0 clock status (BLOCK84) */
#define MC_ME_PRTN1_COFB2_STAT_LPI2C1     (1 << 21) /* Bit 21: LPI2C1 clock status (BLOCK85) */
#define MC_ME_PRTN1_COFB2_STAT_LPSPI0     (1 << 22) /* Bit 22: LPSPI0 clock status (BLOCK86) */
#define MC_ME_PRTN1_COFB2_STAT_LPSPI1     (1 << 23) /* Bit 23: LPSPI1 clock status (BLOCK87) */
#define MC_ME_PRTN1_COFB2_STAT_LPSPI2     (1 << 24) /* Bit 24: LPSPI2 clock status (BLOCK88) */
#define MC_ME_PRTN1_COFB2_STAT_LPSPI3     (1 << 25) /* Bit 25: LPSPI3 clock status (BLOCK89) */
                                                    /* Bit 26: Reserved */
#define MC_ME_PRTN1_COFB2_STAT_SAI0       (1 << 27) /* Bit 27: SAI0 clock status (BLOCK91) */
#define MC_ME_PRTN1_COFB2_STAT_LPCMP0     (1 << 28) /* Bit 28: LPCMP0 clock status (BLOCK92) */
#define MC_ME_PRTN1_COFB2_STAT_LPCMP1     (1 << 29) /* Bit 29: LPCMP1 clock status (BLOCK93) */
                                                    /* Bit 30: Reserved */
#define MC_ME_PRTN1_COFB2_STAT_TMU        (1 << 31) /* Bit 31: TMU clock status (BLOCK95) */

/* Partition 1 COFB Set 3 Clock Status Register (PRTN1_COFB3_STAT) */

#define MC_ME_PRTN1_COFB3_STAT_CRC        (1 << 0)  /* Bit 0: CRC clock status (BLOCK96) */
#define MC_ME_PRTN1_COFB3_STAT_FCCU       (1 << 1)  /* Bit 1: FCCU clock status (BLOCK97) */
#define MC_ME_PRTN1_COFB3_STAT_MTR        (1 << 2)  /* Bit 2: MTR clock status (BLOCK98) */
#define MC_ME_PRTN1_COFB3_STAT_HSE        (1 << 3)  /* Bit 3: HSE clock status (BLOCK99) */
                                                    /* Bit 4: Reserved */
#define MC_ME_PRTN1_COFB3_STAT_JDC        (1 << 5)  /* Bit 5: JDC clock status (BLOCK101) */
                                                    /* Bit 6: Reserved */
#define MC_ME_PRTN1_COFB3_STAT_CONFIG_GPR (1 << 7)  /* Bit 7: CONFIG_GPR clock status (BLOCK103) */
#define MC_ME_PRTN1_COFB3_STAT_STCU2      (1 << 8)  /* Bit 8: STCU2 clock status (BLOCK104) */
                                                    /* Bits 9-11: Reserved */

