apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_me.h
#define MC_ME_PRTN1_COFB3_STAT_SELFTEST_GPR (1 << 12) /* Bit 12: SELFTEST_GPR clock status (BLOCK108) */

                                                    /* Bits 13-31: Reserved */

/* Partition 1 COFB Set 0 Clock Enable Register (PRTN1_COFB0_CLKEN) */

                                                    /* Bits 0-2: Reserved */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA      (1 << 3)  /* Bit 3: eDMA clock enable (REQ3) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD0 (1 << 4)  /* Bit 4: eDMA TCD0 clock enable (REQ4) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD1 (1 << 5)  /* Bit 5: eDMA TCD1 clock enable (REQ5) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD2 (1 << 6)  /* Bit 6: eDMA TCD2 clock enable (REQ6) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD3 (1 << 7)  /* Bit 7: eDMA TCD3 clock enable (REQ7) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD4 (1 << 8)  /* Bit 8: eDMA TCD4 clock enable (REQ8) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD5 (1 << 9)  /* Bit 9: eDMA TCD5 clock enable (REQ9) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD6 (1 << 10) /* Bit 10: eDMA TCD6 clock enable (REQ10) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD7 (1 << 11) /* Bit 11: eDMA TCD7 clock enable (REQ11) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD8 (1 << 12) /* Bit 12: eDMA TCD8 clock enable (REQ12) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD9 (1 << 13) /* Bit 13: eDMA TCD9 clock enable (REQ13) */

#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD10 (1 << 14) /* Bit 14: eDMA TCD10 clock enable (REQ14) */
#define MC_ME_PRTN1_COFB0_CLKEN_EDMA_TCD11 (1 << 15) /* Bit 15: eDMA TCD11 clock enable (REQ15) */

                                                    /* Bits 16-20: Reserved */
#define MC_ME_PRTN1_COFB0_CLKEN_SDA_AP    (1 << 21) /* Bit 21: SDA-AP clock enable (REQ21) */
#define MC_ME_PRTN1_COFB0_CLKEN_EIM       (1 << 22) /* Bit 22: EIM clock enable (REQ22) */
#define MC_ME_PRTN1_COFB0_CLKEN_ERM       (1 << 23) /* Bit 23: ERM clock enable (REQ23) */
#define MC_ME_PRTN1_COFB0_CLKEN_MSCM      (1 << 24) /* Bit 24: MSCM clock enable (REQ24) */
                                                    /* Bits 25-27: Reserved */
#define MC_ME_PRTN1_COFB0_CLKEN_SWT0      (1 << 28) /* Bit 28: SWT0 clock enable (REQ28) */
#define MC_ME_PRTN1_COFB0_CLKEN_STM0      (1 << 29) /* Bit 29: STM0 clock enable (REQ29) */
                                                    /* Bit 30: Reserved */
#define MC_ME_PRTN1_COFB0_CLKEN_INTM      (1 << 31) /* Bit 31: INTM clock enable (REQ31) */

/* Partition 1 COFB Set 1 Clock Enable Register (PRTN1_COFB1_CLKEN) */

#define MC_ME_PRTN1_COFB1_CLKEN_DMAMUX0   (1 << 0)  /* Bit 0: DMAMUX0 clock enable (REQ32) */
#define MC_ME_PRTN1_COFB1_CLKEN_DMAMUX1   (1 << 1)  /* Bit 1: DMAMUX1 clock enable (REQ33) */
#define MC_ME_PRTN1_COFB1_CLKEN_RTC       (1 << 2)  /* Bit 2: RTC clock enable (REQ34) */
                                                    /* Bits 3-9: Reserved */

#define MC_ME_PRTN1_COFB1_CLKEN_SIUL_VIRTWRAPPER_PDAC3 (1 << 10) /* Bit 10: SIUL_VIRTWRAPPER_PDAC3 clock enable (REQ42) */

                                                    /* Bits 11-12: Reserved */
#define MC_ME_PRTN1_COFB1_CLKEN_WKPU      (1 << 13) /* Bit 13: WKPU clock enable (REQ45) */
                                                    /* Bit 14: Reserved */
#define MC_ME_PRTN1_COFB1_CLKEN_CMU       (1 << 15) /* Bit 15: CMU0-5 clock enable (REQ47) */
                                                    /* Bit 16: Reserved */
#define MC_ME_PRTN1_COFB1_CLKEN_TSPC      (1 << 17) /* Bit 17: TSPC clock enable (REQ49) */
                                                    /* Bit 18: Reserved */
#define MC_ME_PRTN1_COFB1_CLKEN_SXOSC     (1 << 19) /* Bit 19: SXOSC clock enable (REQ51) */
                                                    /* Bit 20: Reserved */
#define MC_ME_PRTN1_COFB1_CLKEN_FXOSC     (1 << 21) /* Bit 21: FXOSC clock enable (REQ53) */
                                                    /* Bits 22-23: Reserved */
#define MC_ME_PRTN1_COFB1_CLKEN_PLL       (1 << 24) /* Bit 24: PLL clock enable (REQ56) */
                                                    /* BIts 25-30: Reserved */
#define MC_ME_PRTN1_COFB1_CLKEN_PIT2      (1 << 31) /* Bit 31: PIT2 clock enable (REQ63) */

/* Partition 1 COFB Set 2 Clock Enable Register (PRTN1_COFB2_CLKEN) */

                                                    /* Bit 0: Reserved */
#define MC_ME_PRTN1_COFB2_CLKEN_FLEXCAN0  (1 << 1)  /* Bit 1: FlexCAN0 clock enable (REQ65) */
#define MC_ME_PRTN1_COFB2_CLKEN_FLEXCAN1  (1 << 2)  /* Bit 2: FlexCAN1 clock enable (REQ66) */
#define MC_ME_PRTN1_COFB2_CLKEN_FLEXCAN2  (1 << 3)  /* Bit 3: FlexCAN2 clock enable (REQ67) */
#define MC_ME_PRTN1_COFB2_CLKEN_FLEXCAN3  (1 << 4)  /* Bit 4: FlexCAN3 clock enable (REQ68) */
#define MC_ME_PRTN1_COFB2_CLKEN_FLEXCAN4  (1 << 5)  /* Bit 5: FlexCAN4 clock enable (REQ69) */
#define MC_ME_PRTN1_COFB2_CLKEN_FLEXCAN5  (1 << 6)  /* Bit 6: FlexCAN5 clock enable (REQ70) */
                                                    /* Bits 7-8: Reserved */
#define MC_ME_PRTN1_COFB2_CLKEN_FLEXIO    (1 << 9)  /* Bit 9: FlexIO clock enable (REQ73) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART0   (1 << 10) /* Bit 10: LPUART0 clock enable (REQ74) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART1   (1 << 11) /* Bit 11: LPUART1 clock enable (REQ75) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART2   (1 << 12) /* Bit 12: LPUART2 clock enable (REQ76) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART3   (1 << 13) /* Bit 13: LPUART3 clock enable (REQ77) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART4   (1 << 14) /* Bit 14: LPUART4 clock enable (REQ78) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART5   (1 << 15) /* Bit 15: LPUART5 clock enable (REQ79) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART6   (1 << 16) /* Bit 16: LPUART6 clock enable (REQ80) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPUART7   (1 << 17) /* Bit 17: LPUART7 clock enable (REQ81) */
                                                    /* Bits 18-19: Reserved */
#define MC_ME_PRTN1_COFB2_CLKEN_LPI2C0    (1 << 20) /* Bit 20: LPI2C0 clock enable (REQ84) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPI2C1    (1 << 21) /* Bit 21: LPI2C1 clock enable (REQ85) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPSPI0    (1 << 22) /* Bit 22: LPSPI0 clock enable (REQ86) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPSPI1    (1 << 23) /* Bit 23: LPSPI1 clock enable (REQ87) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPSPI2    (1 << 24) /* Bit 24: LPSPI2 clock enable (REQ88) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPSPI3    (1 << 25) /* Bit 25: LPSPI3 clock enable (REQ89) */
                                                    /* Bit 26: Reserved */
#define MC_ME_PRTN1_COFB2_CLKEN_SAI0      (1 << 27) /* Bit 27: SAI0 clock enable (REQ91) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPCMP0    (1 << 28) /* Bit 28: LPCMP0 clock enable (REQ92) */
#define MC_ME_PRTN1_COFB2_CLKEN_LPCMP1    (1 << 29) /* Bit 29: LPCMP1 clock enable (REQ93) */
                                                    /* Bit 30: Reserved */
#define MC_ME_PRTN1_COFB2_CLKEN_TMU       (1 << 31) /* Bit 31: TMU clock enable (REQ95) */

/* Partition 1 COFB Set 3 Clock Enable Register (PRTN1_COFB3_CLKEN) */

#define MC_ME_PRTN1_COFB3_CLKEN_CRC       (1 << 0)  /* Bit 0: CRC clock enable (REQ96) */
                                                    /* Bits 1-7: Reserved */
#define MC_ME_PRTN1_COFB3_CLKEN_STCU2     (1 << 8)  /* Bit 8: STCU2 clock enable (REQ104) */
                                                    /* Bits 9-31: Reserved */

