apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_me.h
/* Partition 2 COFB Set 0 Clock Status Register (PRTN2_COFB0_STAT) */

#define MC_ME_PRTN2_COFB0_STAT_XBIC2      (1 << 0)  /* Bit 0: XBIC2 clock status (BLOCK0) */
#define MC_ME_PRTN2_COFB0_STAT_XBIC3      (1 << 1)  /* Bit 1: XBIC3 clock status (BLOCK1) */
                                                    /* Bits 2-3: Reserved */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD12 (1 << 4)  /* Bit 4: eDMA TCD12 clock status (BLOCK4) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD13 (1 << 5)  /* Bit 5: eDMA TCD13 clock status (BLOCK5) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD14 (1 << 6)  /* Bit 6: eDMA TCD14 clock status (BLOCK6) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD15 (1 << 7)  /* Bit 7: eDMA TCD15 clock status (BLOCK7) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD16 (1 << 8)  /* Bit 8: eDMA TCD16 clock status (BLOCK8) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD17 (1 << 9)  /* Bit 9: eDMA TCD17 clock status (BLOCK9) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD18 (1 << 10) /* Bit 10: eDMA TCD18 clock status (BLOCK10) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD19 (1 << 11) /* Bit 11: eDMA TCD19 clock status (BLOCK11) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD20 (1 << 12) /* Bit 12: eDMA TCD20 clock status (BLOCK12) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD21 (1 << 13) /* Bit 13: eDMA TCD21 clock status (BLOCK13) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD22 (1 << 14) /* Bit 14: eDMA TCD22 clock status (BLOCK14) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD23 (1 << 15) /* Bit 15: eDMA TCD23 clock status (BLOCK15) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD24 (1 << 16) /* Bit 16: eDMA TCD24 clock status (BLOCK16) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD25 (1 << 17) /* Bit 17: eDMA TCD25 clock status (BLOCK17) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD26 (1 << 18) /* Bit 18: eDMA TCD26 clock status (BLOCK18) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD27 (1 << 19) /* Bit 19: eDMA TCD27 clock status (BLOCK19) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD28 (1 << 20) /* Bit 20: eDMA TCD28 clock status (BLOCK20) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD29 (1 << 21) /* Bit 21: eDMA TCD29 clock status (BLOCK21) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD30 (1 << 22) /* Bit 22: eDMA TCD30 clock status (BLOCK22) */
#define MC_ME_PRTN2_COFB0_STAT_EDMA_TCD31 (1 << 23) /* Bit 23: eDMA TCD31 clock status (BLOCK23) */
#define MC_ME_PRTN2_COFB0_STAT_SEMA42     (1 << 24) /* Bit 24: SEMA42 clock status (BLOCK24) */
#define MC_ME_PRTN2_COFB0_STAT_PRAMC1     (1 << 25) /* Bit 25: PRAMC1 clock status (BLOCK25) */
                                                    /* Bit 26: Reserved */
#define MC_ME_PRTN2_COFB0_STAT_SWT1       (1 << 27) /* Bit 27: SWT1 clock status (BLOCK27) */
                                                    /* Bit 28: Reserved */
#define MC_ME_PRTN2_COFB0_STAT_STM1       (1 << 29) /* Bit 29: STM1 clock status (BLOCK29) */
                                                    /* Bit 30-31: Reserved */

/* Partition 2 COFB Set 1 Clock Status Register (PRTN2_COFB1_STAT) */

#define MC_ME_PRTN2_COFB1_STAT_EMAC       (1 << 0)  /* Bit 0: EMAC clock status (BLOCK32) */
                                                    /* Bits 1-2: Reserved */
#define MC_ME_PRTN2_COFB1_STAT_LPUART8    (1 << 3)  /* Bit 3: LPUART8 clock status (BLOCK35) */
#define MC_ME_PRTN2_COFB1_STAT_LPUART9    (1 << 4)  /* Bit 4: LPUART9 clock status (BLOCK36) */
#define MC_ME_PRTN2_COFB1_STAT_LPUART10   (1 << 5)  /* Bit 5: LPUART10 clock status (BLOCK37) */
#define MC_ME_PRTN2_COFB1_STAT_LPUART11   (1 << 6)  /* Bit 6: LPUART11 clock status (BLOCK38) */
#define MC_ME_PRTN2_COFB1_STAT_LPUART12   (1 << 7)  /* Bit 7: LPUART12 clock status (BLOCK39) */
#define MC_ME_PRTN2_COFB1_STAT_LPUART13   (1 << 8)  /* Bit 8: LPUART13 clock status (BLOCK40) */
#define MC_ME_PRTN2_COFB1_STAT_LPUART14   (1 << 9)  /* Bit 9: LPUART14 clock status (BLOCK41) */
#define MC_ME_PRTN2_COFB1_STAT_LPUART15   (1 << 10) /* Bit 10: LPUART15 clock status (BLOCK42) */
                                                    /* Bits 11-14: Reserved */
#define MC_ME_PRTN2_COFB1_STAT_LPSPI4     (1 << 15) /* Bit 15: LPSPI4 clock status (BLOCK47) */
#define MC_ME_PRTN2_COFB1_STAT_LPSPI5     (1 << 16) /* Bit 16: LPSPI5 clock status (BLOCK48) */
                                                    /* Bits 17-18: Reserved */
#define MC_ME_PRTN2_COFB1_STAT_QSPI       (1 << 19) /* Bit 19: QuadSPI clock status (BLOCK51) */
                                                    /* Bit 20-22: Reserved */
#define MC_ME_PRTN2_COFB1_STAT_SAI1       (1 << 23) /* Bit 23: SAI1 clock status (BLOCK55) */
                                                    /* Bits 24-25: Reserved */
#define MC_ME_PRTN2_COFB1_STAT_LCMP2      (1 << 26) /* Bit 26: LPCMP2 clock status (BLOCK58) */
#define MC_ME_PRTN2_COFB1_STAT_HSE        (1 << 27) /* Bit 27: HSE clock status (BLOCK59) */
                                                    /* Bit 28-29: Reserved */
#define MC_ME_PRTN2_COFB1_STAT_CM7_0_TCM  (1 << 30) /* Bit 30: CM7_0_TCM clock status (BLOCK62) */
#define MC_ME_PRTN2_COFB1_STAT_CM7_1_TCM  (1 << 31) /* Bit 31: CM7_1_TCM clock status (BLOCK63) */

/* Partition 2 COFB Set 0 Clock Enable Register (PRTN2_COFB0_CLKEN) */

                                                    /* Bits 0-3: Reserved */

#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD12 (1 << 4)  /* Bit 4: eDMA TCD12 clock enable (REQ4) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD13 (1 << 5)  /* Bit 5: eDMA TCD13 clock enable (REQ5) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD14 (1 << 6)  /* Bit 6: eDMA TCD14 clock enable (REQ6) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD15 (1 << 7)  /* Bit 7: eDMA TCD15 clock enable (REQ7) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD16 (1 << 8)  /* Bit 8: eDMA TCD16 clock enable (REQ8) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD17 (1 << 9)  /* Bit 9: eDMA TCD17 clock enable (REQ9) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD18 (1 << 10) /* Bit 10: eDMA TCD18 clock enable (REQ10) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD19 (1 << 11) /* Bit 11: eDMA TCD19 clock enable (REQ11) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD20 (1 << 12) /* Bit 12: eDMA TCD20 clock enable (REQ12) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD21 (1 << 13) /* Bit 13: eDMA TCD21 clock enable (REQ13) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD22 (1 << 14) /* Bit 14: eDMA TCD22 clock enable (REQ14) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD23 (1 << 15) /* Bit 15: eDMA TCD23 clock enable (REQ15) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD24 (1 << 16) /* Bit 16: eDMA TCD24 clock enable (REQ16) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD25 (1 << 17) /* Bit 17: eDMA TCD25 clock enable (REQ17) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD26 (1 << 18) /* Bit 18: eDMA TCD26 clock enable (REQ18) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD27 (1 << 19) /* Bit 19: eDMA TCD27 clock enable (REQ19) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD28 (1 << 20) /* Bit 20: eDMA TCD28 clock enable (REQ20) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD29 (1 << 21) /* Bit 21: eDMA TCD29 clock enable (REQ21) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD30 (1 << 22) /* Bit 22: eDMA TCD30 clock enable (REQ22) */
#define MC_ME_PRTN2_COFB0_CLKEN_EDMA_TCD31 (1 << 23) /* Bit 23: eDMA TCD31 clock enable (REQ23) */

#define MC_ME_PRTN2_COFB0_CLKEN_SEMA42    (1 << 24) /* Bit 24: SEMA42 clock enable (REQ24) */
                                                    /* Bits 25-26: Reserved */
#define MC_ME_PRTN2_COFB0_CLKEN_SWT1      (1 << 27) /* Bit 27: SWT1 clock enable (REQ27) */
                                                    /* Bit 28: Reserved */
#define MC_ME_PRTN2_COFB0_CLKEN_STM1      (1 << 29) /* Bit 29: STM1 clock enable (REQ29) */
                                                    /* Bit 30-31: Reserved */

