apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_mc_me.h
/* Partition 2 COFB Set 1 Clock Enable Register (PRTN2_COFB1_CLKEN) */

#define MC_ME_PRTN2_COFB1_CLKEN_EMAC      (1 << 0)  /* Bit 0: EMAC clock enable (REQ32) */
                                                    /* Bits 1-2: Reserved */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART8   (1 << 3)  /* Bit 3: LPUART8 clock enable (REQ35) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART9   (1 << 4)  /* Bit 4: LPUART9 clock enable (REQ36) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART10  (1 << 5)  /* Bit 5: LPUART10 clock enable (REQ37) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART11  (1 << 6)  /* Bit 6: LPUART11 clock enable (REQ38) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART12  (1 << 7)  /* Bit 7: LPUART12 clock enable (REQ39) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART13  (1 << 8)  /* Bit 8: LPUART13 clock enable (REQ40) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART14  (1 << 9)  /* Bit 9: LPUART14 clock enable (REQ41) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPUART15  (1 << 10) /* Bit 10: LPUART15 clock enable (REQ42) */
                                                    /* Bits 11-14: Reserved */
#define MC_ME_PRTN2_COFB1_CLKEN_LPSPI4    (1 << 15) /* Bit 15: LPSPI4 clock enable (REQ47) */
#define MC_ME_PRTN2_COFB1_CLKEN_LPSPI5    (1 << 16) /* Bit 16: LPSPI5 clock enable (REQ48) */
                                                    /* Bits 17-18: Reserved */
#define MC_ME_PRTN2_COFB1_CLKEN_QSPI      (1 << 19) /* Bit 19: QuadSPI clock enable (REQ51) */
                                                    /* Bit 20-22: Reserved */
#define MC_ME_PRTN2_COFB1_CLKEN_SAI1      (1 << 23) /* Bit 23: SAI1 clock enable (REQ55) */
                                                    /* Bits 24-25: Reserved */
#define MC_ME_PRTN2_COFB1_CLKEN_LCMP2     (1 << 26) /* Bit 26: LPCMP2 clock enable (REQ58) */
                                                    /* Bit 27-29: Reserved */
#define MC_ME_PRTN2_COFB1_CLKEN_CM7_0_TCM (1 << 30) /* Bit 30: CM7_0_TCM clock enable (REQ62) */
#define MC_ME_PRTN2_COFB1_CLKEN_CM7_1_TCM (1 << 31) /* Bit 31: CM7_1_TCM clock enable (REQ63) */

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_MC_ME_H */
